import axios from 'axios';

//-----------------------------------------------------------------Глобальні-змінні
let tailCategories;
//---------------------------------------------------------------------------------
//--------------------------------------------------------------------------Функції
function tailsGetCategories() {
  axios
    .get('https://paw-hut.b.goit.study/api/categories')
    .then(res => {
      console.log(res);
    })
    .catch(err => {
      console.log(err);
    });
}

function tailsGetArrAnimals() {}
//---------------------------------------------------------------------------------
//------------------------------------------------------------------Загальна-логіка
tailCategories();
